#### DatumExtentType Enumeration

---

|  |
| --- |
| See Also |

Represents the type of datum extent that is displayed in a particular view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public enum DatumExtentType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DatumExtentType ``` |

| Visual C++ |
| --- |
| ``` public enum class DatumExtentType ``` |

# Members

| Member name | Description |
| --- | --- |
| Model | The extent represents the actual 3D extent of the datum plane. |
| ViewSpecific | The extent displayed is specific to the view and does not represent the actual 3D extent of the datum plane. |

# See Also

Autodesk.Revit.DB Namespace